#+Title: A Haskell toolchain
#+Author: Nicolas Rolland
#+Email: nicolas.rolland@gmail.com
#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_mathjax:t reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil

* unix shell

  - *zsh* : smart, has extensions
  - [[https://github.com/skwp/dotfiles][yadr]] ready for action

#+BEGIN_SRC sh
ls -la ~/.zsh.after/
#+END_SRC
#+RESULTS:
| total      | 56 |          |       |     |     |    |       |                       |
| drwxr-xr-x | 10 | nrolland | staff | 340 | May | 31 | 15:41 | .                     |
| drwxr-xr-x |  5 | nrolland | staff | 170 | May | 31 | 15:41 | ..                    |
| -rw-r--r-- |  1 | nrolland | staff | 841 | Apr | 19 | 10:59 | alias.zsh             |
| -rw-r--r-- |  1 | nrolland | staff |  76 | Apr | 19 | 10:59 | coq.zsh               |
| -rw-r--r-- |  1 | nrolland | staff |  43 | May | 31 | 15:41 | haskellGlobal.old     |
| -rw-r--r-- |  1 | nrolland | staff |  50 | Apr | 19 | 10:59 | locale.zsh            |
| drwxr-xr-x | 28 | nrolland | staff | 952 | May | 31 | 16:20 | nix-zsh-completions   |
| -rw-r--r-- |  1 | nrolland | staff | 751 | Jun |  7 | 18:29 | nix.zsh               |
| -rw-r--r-- |  1 | nrolland | staff | 145 | May | 31 | 15:41 | nixzshCompletions.zsh |
| -rw-r--r-- |  1 | nrolland | staff | 353 | Apr | 19 | 10:59 | prompt.zsh            |


** Usage in GHC

GHC only knows about packages that are installed. To see which packages are installed, use the 

ghc-pkg list command:
#+BEGIN_SRC sh
ghc-pkg list | head
#+END_SRC

#+RESULTS:
| /nix/store/w7rk2j11b7dnwncxvcn9w4myqnnfh1iq-ghc-7.8.4/lib/ghc-7.8.4/package.conf.d: |
| Cabal-1.18.1.5                                                                      |
| HTTP-4000.2.19                                                                      |
| HUnit-1.2.5.2                                                                       |
| HsOpenSSL-0.11.1.1                                                                  |
| IfElse-0.85                                                                         |
| JuicyPixels-3.2.4                                                                   |
| MemoTrie-0.6.2                                                                      |
| MissingH-1.3.0.1                                                                    |
| MonadCatchIO-transformers-0.3.1.3                                                   |





